Расширения/УХ_ДОП/DataProcessors/Тест_Доработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Тест_Доработки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Расширения/УХ_ДОП/Enums/СистемаНалогообложенияКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СистемаНалогообложенияКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Расширения/УХ_ДОП/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалогооблажения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемаНалогообложенияКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Расширения/УХ_ДОП/DataProcessors/Тест_Доработки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ТекстНаСервере()
	
	URLСервисаVeLab 		= "rtsapi.star-pro.ru";//"star-pro-proxy.gzdom.local:10080";
	TokenVelab 				= "Bearer 75f9a1b8f18b486db9d75f5eff944964";		
	ЗСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(URLСервисаVeLab,,,,,10,ЗСоединение);	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыСправочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК КонтрагентыСправочник
		|ГДЕ
		|	НЕ КонтрагентыСправочник.ПометкаУдаления
		//|	И КонтрагентыСправочник.Родитель = &Родитель
		|	И НЕ КонтрагентыСправочник.ЭтоГруппа
		|	И КонтрагентыСправочник.ВидНалогооблажения = ЗНАЧЕНИЕ(Перечисление.СистемаНалогообложенияКонтрагента.УСН)
		|	И КонтрагентыСправочник.ИНН <> """"";
	
	//Запрос.УстановитьПараметр("Родитель", Справочники.Контрагенты.НайтиПоКоду("00-000013")); 
	//Запрос.УстановитьПараметр("ИНН"		, "7719816961");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Система = Неопределено;	
		ИнтеграцияSatrPro.ОпределитьСистемуНалогооблаженияКонтрагента(ВыборкаДетальныеЗаписи.Ссылка,Система,HTTPСоединение,TokenVelab);
		
		Если Система = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОКонтрагент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОКонтрагент.ВидНалогооблажения = Система;
		
		Если Система = Перечисления.СистемаНалогообложенияКонтрагента.ОСН Тогда
			
			ОКонтрагент.СтавкаНДС = 0.2;
		ИначеЕсли Система = Перечисления.СистемаНалогообложенияКонтрагента.УСН Тогда
			ОКонтрагент.СтавкаНДС = 0.07;
		КонецЕсли;
		
		ОКонтрагент.Записать();
		//сек = 15;
		//КонДата = ТекущаяДата() + сек;
		//Пока ТекущаяДата() < КонДата Цикл
		//	// ждемссс....
		//КонецЦикла;      
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

	
КонецПроцедуры

&НаКлиенте
Процедура Текст(Команда)
	ТекстНаСервере();
КонецПроцедуры
